loadtests/results_soak.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtests/soak.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  0m00.7s/5m0s

running (0m02.0s), 50/50 VUs, 41 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  0m01.7s/5m0s

running (0m03.0s), 50/50 VUs, 47 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  0m02.7s/5m0s

running (0m04.0s), 50/50 VUs, 78 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  0m03.7s/5m0s

running (0m05.0s), 50/50 VUs, 128 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m04.7s/5m0s

running (0m06.0s), 50/50 VUs, 178 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m05.7s/5m0s

running (0m07.0s), 50/50 VUs, 225 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m06.7s/5m0s

running (0m08.0s), 50/50 VUs, 272 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m07.7s/5m0s

running (0m09.0s), 50/50 VUs, 322 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m08.7s/5m0s

running (0m10.0s), 50/50 VUs, 360 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m09.7s/5m0s

running (0m11.0s), 50/50 VUs, 403 complete and 0 interrupted iterations
default   [   4% ] 50 VUs  0m10.7s/5m0s

running (0m12.0s), 50/50 VUs, 453 complete and 0 interrupted iterations
default   [   4% ] 50 VUs  0m11.7s/5m0s

running (0m13.0s), 50/50 VUs, 498 complete and 0 interrupted iterations
default   [   4% ] 50 VUs  0m12.7s/5m0s

running (0m14.0s), 50/50 VUs, 548 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m13.7s/5m0s

running (0m15.0s), 50/50 VUs, 595 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m14.7s/5m0s

running (0m16.0s), 50/50 VUs, 645 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m15.7s/5m0s

running (0m17.0s), 50/50 VUs, 692 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  0m16.7s/5m0s

running (0m18.0s), 50/50 VUs, 742 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  0m17.7s/5m0s

running (0m19.0s), 50/50 VUs, 792 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  0m18.7s/5m0s

running (0m20.0s), 50/50 VUs, 842 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m19.7s/5m0s

running (0m21.0s), 50/50 VUs, 892 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m20.7s/5m0s

running (0m22.0s), 50/50 VUs, 942 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m21.7s/5m0s

running (0m23.0s), 50/50 VUs, 992 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m22.7s/5m0s

running (0m24.0s), 50/50 VUs, 1042 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m23.7s/5m0s

running (0m25.0s), 50/50 VUs, 1092 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m24.7s/5m0s

running (0m26.0s), 50/50 VUs, 1134 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  0m25.7s/5m0s

running (0m27.0s), 50/50 VUs, 1174 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  0m26.7s/5m0s

running (0m28.0s), 50/50 VUs, 1224 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  0m27.7s/5m0s

running (0m29.0s), 50/50 VUs, 1259 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m28.7s/5m0s

running (0m30.0s), 50/50 VUs, 1309 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m29.7s/5m0s

running (0m31.0s), 50/50 VUs, 1358 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m30.7s/5m0s

running (0m32.0s), 50/50 VUs, 1408 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  0m31.7s/5m0s

running (0m33.0s), 50/50 VUs, 1454 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  0m32.7s/5m0s

running (0m34.0s), 50/50 VUs, 1502 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  0m33.7s/5m0s

running (0m35.0s), 50/50 VUs, 1552 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m34.7s/5m0s

running (0m36.0s), 50/50 VUs, 1564 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m35.7s/5m0s

running (0m37.0s), 50/50 VUs, 1603 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m36.7s/5m0s

running (0m38.0s), 50/50 VUs, 1653 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m37.7s/5m0s

running (0m39.0s), 50/50 VUs, 1703 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m38.7s/5m0s

running (0m40.0s), 50/50 VUs, 1753 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m39.7s/5m0s

running (0m41.0s), 50/50 VUs, 1798 complete and 0 interrupted iterations
default   [  14% ] 50 VUs  0m40.7s/5m0s

running (0m42.0s), 50/50 VUs, 1840 complete and 0 interrupted iterations
default   [  14% ] 50 VUs  0m41.7s/5m0s

running (0m43.0s), 50/50 VUs, 1890 complete and 0 interrupted iterations
default   [  14% ] 50 VUs  0m42.7s/5m0s

running (0m44.0s), 50/50 VUs, 1921 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m43.7s/5m0s

running (0m45.0s), 50/50 VUs, 1929 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m44.7s/5m0s

running (0m46.0s), 50/50 VUs, 1975 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m45.7s/5m0s

running (0m47.0s), 50/50 VUs, 2025 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  0m46.7s/5m0s

running (0m48.0s), 50/50 VUs, 2075 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  0m47.7s/5m0s

running (0m49.0s), 50/50 VUs, 2125 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  0m48.7s/5m0s

running (0m50.0s), 50/50 VUs, 2175 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m49.7s/5m0s

running (0m51.0s), 50/50 VUs, 2223 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m50.7s/5m0s

running (0m52.0s), 50/50 VUs, 2273 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m51.7s/5m0s

running (0m53.0s), 50/50 VUs, 2323 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m52.7s/5m0s

running (0m54.0s), 50/50 VUs, 2372 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m53.7s/5m0s

running (0m55.0s), 50/50 VUs, 2420 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m54.7s/5m0s

running (0m56.0s), 50/50 VUs, 2465 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  0m55.7s/5m0s

running (0m57.0s), 50/50 VUs, 2505 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  0m56.7s/5m0s

running (0m58.0s), 50/50 VUs, 2554 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  0m57.7s/5m0s

running (0m59.0s), 50/50 VUs, 2601 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m58.7s/5m0s

running (1m00.0s), 50/50 VUs, 2651 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m59.7s/5m0s

running (1m01.0s), 50/50 VUs, 2701 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  1m00.7s/5m0s

running (1m02.0s), 50/50 VUs, 2751 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  1m01.7s/5m0s

running (1m03.0s), 50/50 VUs, 2793 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  1m02.7s/5m0s

running (1m04.0s), 50/50 VUs, 2839 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  1m03.7s/5m0s

running (1m05.0s), 50/50 VUs, 2887 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  1m04.7s/5m0s

running (1m06.0s), 50/50 VUs, 2937 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  1m05.7s/5m0s

running (1m07.0s), 50/50 VUs, 2987 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  1m06.7s/5m0s

running (1m08.0s), 50/50 VUs, 3037 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  1m07.7s/5m0s

running (1m09.0s), 50/50 VUs, 3087 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  1m08.7s/5m0s

running (1m10.0s), 50/50 VUs, 3137 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  1m09.7s/5m0s

running (1m11.0s), 50/50 VUs, 3175 complete and 0 interrupted iterations
default   [  24% ] 50 VUs  1m10.7s/5m0s

running (1m12.0s), 50/50 VUs, 3225 complete and 0 interrupted iterations
default   [  24% ] 50 VUs  1m11.7s/5m0s

running (1m13.0s), 50/50 VUs, 3275 complete and 0 interrupted iterations
default   [  24% ] 50 VUs  1m12.7s/5m0s

running (1m14.0s), 50/50 VUs, 3325 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  1m13.7s/5m0s

running (1m15.0s), 50/50 VUs, 3373 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  1m14.7s/5m0s

running (1m16.0s), 50/50 VUs, 3421 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  1m15.7s/5m0s

running (1m17.0s), 50/50 VUs, 3471 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  1m16.7s/5m0s

running (1m18.0s), 50/50 VUs, 3521 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  1m17.7s/5m0s

running (1m19.0s), 50/50 VUs, 3571 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  1m18.7s/5m0s

running (1m20.0s), 50/50 VUs, 3618 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  1m19.7s/5m0s

running (1m21.0s), 50/50 VUs, 3660 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  1m20.7s/5m0s

running (1m22.0s), 50/50 VUs, 3710 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  1m21.7s/5m0s

running (1m23.0s), 50/50 VUs, 3746 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  1m22.7s/5m0s

running (1m24.0s), 50/50 VUs, 3796 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  1m23.7s/5m0s

running (1m25.0s), 50/50 VUs, 3846 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  1m24.7s/5m0s

running (1m26.0s), 50/50 VUs, 3896 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  1m25.7s/5m0s

running (1m27.0s), 50/50 VUs, 3940 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  1m26.7s/5m0s

running (1m28.0s), 50/50 VUs, 3987 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  1m27.7s/5m0s

running (1m29.0s), 50/50 VUs, 4037 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  1m28.7s/5m0s

running (1m30.0s), 50/50 VUs, 4087 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  1m29.7s/5m0s

running (1m31.0s), 50/50 VUs, 4137 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  1m30.7s/5m0s

running (1m32.0s), 50/50 VUs, 4187 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  1m31.7s/5m0s

running (1m33.0s), 50/50 VUs, 4237 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  1m32.7s/5m0s

running (1m34.0s), 50/50 VUs, 4287 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  1m33.7s/5m0s

running (1m35.0s), 50/50 VUs, 4337 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  1m34.7s/5m0s

running (1m36.0s), 50/50 VUs, 4387 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  1m35.7s/5m0s

running (1m37.0s), 50/50 VUs, 4437 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  1m36.7s/5m0s

running (1m38.0s), 50/50 VUs, 4487 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  1m37.7s/5m0s

running (1m39.0s), 50/50 VUs, 4537 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  1m38.7s/5m0s

running (1m40.0s), 50/50 VUs, 4587 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  1m39.7s/5m0s

running (1m41.0s), 50/50 VUs, 4637 complete and 0 interrupted iterations
default   [  34% ] 50 VUs  1m40.7s/5m0s

running (1m42.0s), 50/50 VUs, 4687 complete and 0 interrupted iterations
default   [  34% ] 50 VUs  1m41.7s/5m0s

running (1m43.0s), 50/50 VUs, 4737 complete and 0 interrupted iterations
default   [  34% ] 50 VUs  1m42.7s/5m0s

running (1m44.0s), 50/50 VUs, 4787 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  1m43.7s/5m0s

running (1m45.0s), 50/50 VUs, 4837 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  1m44.7s/5m0s

running (1m46.0s), 50/50 VUs, 4887 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  1m45.7s/5m0s

running (1m47.0s), 50/50 VUs, 4937 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  1m46.7s/5m0s

running (1m48.0s), 50/50 VUs, 4947 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  1m47.7s/5m0s

running (1m49.0s), 50/50 VUs, 4997 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  1m48.7s/5m0s

running (1m50.0s), 50/50 VUs, 5045 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  1m49.7s/5m0s

running (1m51.0s), 50/50 VUs, 5092 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  1m50.7s/5m0s

running (1m52.0s), 50/50 VUs, 5139 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  1m51.7s/5m0s

running (1m53.0s), 50/50 VUs, 5187 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  1m52.7s/5m0s

running (1m54.0s), 50/50 VUs, 5237 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  1m53.7s/5m0s

running (1m55.0s), 50/50 VUs, 5287 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  1m54.7s/5m0s

running (1m56.0s), 50/50 VUs, 5337 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  1m55.7s/5m0s

running (1m57.0s), 50/50 VUs, 5387 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  1m56.7s/5m0s

running (1m58.0s), 50/50 VUs, 5437 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  1m57.7s/5m0s

running (1m59.0s), 50/50 VUs, 5487 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  1m58.7s/5m0s

running (2m00.0s), 50/50 VUs, 5537 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  1m59.7s/5m0s

running (2m01.0s), 50/50 VUs, 5587 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  2m00.7s/5m0s

running (2m02.0s), 50/50 VUs, 5637 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  2m01.7s/5m0s

running (2m03.0s), 50/50 VUs, 5687 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  2m02.7s/5m0s

running (2m04.0s), 50/50 VUs, 5737 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  2m03.7s/5m0s

running (2m05.0s), 50/50 VUs, 5787 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  2m04.7s/5m0s

running (2m06.0s), 50/50 VUs, 5837 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  2m05.7s/5m0s

running (2m07.0s), 50/50 VUs, 5887 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  2m06.7s/5m0s

running (2m08.0s), 50/50 VUs, 5937 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  2m07.7s/5m0s

running (2m09.0s), 50/50 VUs, 5987 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  2m08.7s/5m0s

running (2m10.0s), 50/50 VUs, 6037 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  2m09.7s/5m0s

running (2m11.0s), 50/50 VUs, 6087 complete and 0 interrupted iterations
default   [  44% ] 50 VUs  2m10.7s/5m0s

running (2m12.0s), 50/50 VUs, 6137 complete and 0 interrupted iterations
default   [  44% ] 50 VUs  2m11.7s/5m0s

running (2m13.0s), 50/50 VUs, 6187 complete and 0 interrupted iterations
default   [  44% ] 50 VUs  2m12.7s/5m0s

running (2m14.0s), 50/50 VUs, 6237 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  2m13.7s/5m0s

running (2m15.0s), 50/50 VUs, 6284 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  2m14.7s/5m0s

running (2m16.0s), 50/50 VUs, 6325 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  2m15.7s/5m0s

running (2m17.0s), 50/50 VUs, 6374 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  2m16.7s/5m0s

running (2m18.0s), 50/50 VUs, 6424 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  2m17.7s/5m0s

running (2m19.0s), 50/50 VUs, 6470 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  2m18.7s/5m0s

running (2m20.0s), 50/50 VUs, 6520 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  2m19.7s/5m0s

running (2m21.0s), 50/50 VUs, 6570 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  2m20.7s/5m0s

running (2m22.0s), 50/50 VUs, 6587 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  2m21.7s/5m0s

running (2m23.0s), 50/50 VUs, 6637 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  2m22.7s/5m0s

running (2m24.0s), 50/50 VUs, 6687 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  2m23.7s/5m0s

running (2m25.0s), 50/50 VUs, 6737 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  2m24.7s/5m0s

running (2m26.0s), 50/50 VUs, 6787 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  2m25.7s/5m0s

running (2m27.0s), 50/50 VUs, 6837 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  2m26.7s/5m0s

running (2m28.0s), 50/50 VUs, 6887 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  2m27.7s/5m0s

running (2m29.0s), 50/50 VUs, 6937 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  2m28.7s/5m0s

running (2m30.0s), 50/50 VUs, 6987 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  2m29.7s/5m0s

running (2m31.0s), 50/50 VUs, 7037 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  2m30.7s/5m0s

running (2m32.0s), 50/50 VUs, 7087 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  2m31.7s/5m0s

running (2m33.0s), 50/50 VUs, 7137 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  2m32.7s/5m0s

running (2m34.0s), 50/50 VUs, 7187 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  2m33.7s/5m0s

running (2m35.0s), 50/50 VUs, 7237 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  2m34.7s/5m0s

running (2m36.0s), 50/50 VUs, 7287 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  2m35.7s/5m0s

running (2m37.0s), 50/50 VUs, 7337 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  2m36.7s/5m0s

running (2m38.0s), 50/50 VUs, 7387 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  2m37.7s/5m0s

running (2m39.0s), 50/50 VUs, 7437 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  2m38.7s/5m0s

running (2m40.0s), 50/50 VUs, 7487 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  2m39.7s/5m0s

running (2m41.0s), 50/50 VUs, 7537 complete and 0 interrupted iterations
default   [  54% ] 50 VUs  2m40.7s/5m0s

running (2m42.0s), 50/50 VUs, 7587 complete and 0 interrupted iterations
default   [  54% ] 50 VUs  2m41.7s/5m0s

running (2m43.0s), 50/50 VUs, 7629 complete and 0 interrupted iterations
default   [  54% ] 50 VUs  2m42.7s/5m0s

running (2m44.0s), 50/50 VUs, 7679 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  2m43.7s/5m0s

running (2m45.0s), 50/50 VUs, 7729 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  2m44.7s/5m0s

running (2m46.0s), 50/50 VUs, 7778 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  2m45.7s/5m0s

running (2m47.0s), 50/50 VUs, 7828 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  2m46.7s/5m0s

running (2m48.0s), 50/50 VUs, 7870 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  2m47.7s/5m0s

running (2m49.0s), 50/50 VUs, 7891 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  2m48.7s/5m0s

running (2m50.0s), 50/50 VUs, 7941 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  2m49.7s/5m0s

running (2m51.0s), 50/50 VUs, 7990 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  2m50.7s/5m0s

running (2m52.0s), 50/50 VUs, 8040 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  2m51.7s/5m0s

running (2m53.0s), 50/50 VUs, 8090 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  2m52.7s/5m0s

running (2m54.0s), 50/50 VUs, 8140 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  2m53.7s/5m0s

running (2m55.0s), 50/50 VUs, 8190 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  2m54.7s/5m0s

running (2m56.0s), 50/50 VUs, 8239 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  2m55.7s/5m0s

running (2m57.0s), 50/50 VUs, 8287 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  2m56.7s/5m0s

running (2m58.0s), 50/50 VUs, 8337 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  2m57.7s/5m0s

running (2m59.0s), 50/50 VUs, 8387 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  2m58.7s/5m0s

running (3m00.0s), 50/50 VUs, 8437 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  2m59.7s/5m0s

running (3m01.0s), 50/50 VUs, 8487 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  3m00.7s/5m0s

running (3m02.0s), 50/50 VUs, 8537 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  3m01.7s/5m0s

running (3m03.0s), 50/50 VUs, 8583 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  3m02.7s/5m0s

running (3m04.0s), 50/50 VUs, 8629 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  3m03.7s/5m0s

running (3m05.0s), 50/50 VUs, 8679 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  3m04.7s/5m0s

running (3m06.0s), 50/50 VUs, 8729 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  3m05.7s/5m0s

running (3m07.0s), 50/50 VUs, 8779 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  3m06.7s/5m0s

running (3m08.0s), 50/50 VUs, 8826 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  3m07.7s/5m0s

running (3m09.0s), 50/50 VUs, 8873 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  3m08.7s/5m0s

running (3m10.0s), 50/50 VUs, 8922 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  3m09.7s/5m0s

running (3m11.0s), 50/50 VUs, 8972 complete and 0 interrupted iterations
default   [  64% ] 50 VUs  3m10.7s/5m0s

running (3m12.0s), 50/50 VUs, 9018 complete and 0 interrupted iterations
default   [  64% ] 50 VUs  3m11.7s/5m0s

running (3m13.0s), 50/50 VUs, 9068 complete and 0 interrupted iterations
default   [  64% ] 50 VUs  3m12.7s/5m0s

running (3m14.0s), 50/50 VUs, 9118 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  3m13.7s/5m0s

running (3m15.0s), 50/50 VUs, 9168 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  3m14.7s/5m0s

running (3m16.0s), 50/50 VUs, 9218 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  3m15.7s/5m0s

running (3m17.0s), 50/50 VUs, 9268 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  3m16.7s/5m0s

running (3m18.0s), 50/50 VUs, 9318 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  3m17.7s/5m0s

running (3m19.0s), 50/50 VUs, 9368 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  3m18.7s/5m0s

running (3m20.0s), 50/50 VUs, 9416 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  3m19.7s/5m0s

running (3m21.0s), 50/50 VUs, 9465 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  3m20.7s/5m0s

running (3m22.0s), 50/50 VUs, 9493 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  3m21.7s/5m0s

running (3m23.0s), 50/50 VUs, 9543 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  3m22.7s/5m0s

running (3m24.0s), 50/50 VUs, 9593 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  3m23.7s/5m0s

running (3m25.0s), 50/50 VUs, 9643 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  3m24.7s/5m0s

running (3m26.0s), 50/50 VUs, 9693 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  3m25.7s/5m0s

running (3m27.0s), 50/50 VUs, 9743 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  3m26.7s/5m0s

running (3m28.0s), 50/50 VUs, 9793 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  3m27.7s/5m0s

running (3m29.0s), 50/50 VUs, 9841 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  3m28.7s/5m0s

running (3m30.0s), 50/50 VUs, 9891 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  3m29.7s/5m0s

running (3m31.0s), 50/50 VUs, 9941 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  3m30.7s/5m0s

running (3m32.0s), 50/50 VUs, 9979 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  3m31.7s/5m0s

running (3m33.0s), 50/50 VUs, 10029 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  3m32.7s/5m0s

running (3m34.0s), 50/50 VUs, 10079 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  3m33.7s/5m0s

running (3m35.0s), 50/50 VUs, 10129 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  3m34.7s/5m0s

running (3m36.0s), 50/50 VUs, 10179 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  3m35.7s/5m0s

running (3m37.0s), 50/50 VUs, 10229 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  3m36.7s/5m0s

running (3m38.0s), 50/50 VUs, 10279 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  3m37.7s/5m0s

running (3m39.0s), 50/50 VUs, 10329 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  3m38.7s/5m0s

running (3m40.0s), 50/50 VUs, 10379 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  3m39.7s/5m0s

running (3m41.0s), 50/50 VUs, 10429 complete and 0 interrupted iterations
default   [  74% ] 50 VUs  3m40.7s/5m0s

running (3m42.0s), 50/50 VUs, 10479 complete and 0 interrupted iterations
default   [  74% ] 50 VUs  3m41.7s/5m0s

running (3m43.0s), 50/50 VUs, 10529 complete and 0 interrupted iterations
default   [  74% ] 50 VUs  3m42.7s/5m0s

running (3m44.0s), 50/50 VUs, 10579 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  3m43.7s/5m0s

running (3m45.0s), 50/50 VUs, 10629 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  3m44.7s/5m0s

running (3m46.0s), 50/50 VUs, 10679 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  3m45.7s/5m0s

running (3m47.0s), 50/50 VUs, 10729 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  3m46.7s/5m0s

running (3m48.0s), 50/50 VUs, 10779 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  3m47.7s/5m0s

running (3m49.0s), 50/50 VUs, 10829 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  3m48.7s/5m0s

running (3m50.0s), 50/50 VUs, 10879 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  3m49.7s/5m0s

running (3m51.0s), 50/50 VUs, 10929 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  3m50.7s/5m0s

running (3m52.0s), 50/50 VUs, 10933 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  3m51.7s/5m0s

running (3m53.0s), 50/50 VUs, 10983 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  3m52.7s/5m0s

running (3m54.0s), 50/50 VUs, 11031 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  3m53.7s/5m0s

running (3m55.0s), 50/50 VUs, 11081 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  3m54.7s/5m0s

running (3m56.0s), 50/50 VUs, 11131 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  3m55.7s/5m0s

running (3m57.0s), 50/50 VUs, 11181 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  3m56.7s/5m0s

running (3m58.0s), 50/50 VUs, 11231 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  3m57.7s/5m0s

running (3m59.0s), 50/50 VUs, 11281 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  3m58.7s/5m0s

running (4m00.0s), 50/50 VUs, 11331 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  3m59.7s/5m0s

running (4m01.0s), 50/50 VUs, 11381 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  4m00.7s/5m0s

running (4m02.0s), 50/50 VUs, 11431 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  4m01.7s/5m0s

running (4m03.0s), 50/50 VUs, 11481 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  4m02.7s/5m0s

running (4m04.0s), 50/50 VUs, 11531 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  4m03.7s/5m0s

running (4m05.0s), 50/50 VUs, 11579 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  4m04.7s/5m0s

running (4m06.0s), 50/50 VUs, 11629 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  4m05.7s/5m0s

running (4m07.0s), 50/50 VUs, 11679 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  4m06.7s/5m0s

running (4m08.0s), 50/50 VUs, 11729 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  4m07.7s/5m0s

running (4m09.0s), 50/50 VUs, 11779 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  4m08.7s/5m0s

running (4m10.0s), 50/50 VUs, 11829 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  4m09.7s/5m0s

running (4m11.0s), 50/50 VUs, 11879 complete and 0 interrupted iterations
default   [  84% ] 50 VUs  4m10.7s/5m0s

running (4m12.0s), 50/50 VUs, 11929 complete and 0 interrupted iterations
default   [  84% ] 50 VUs  4m11.7s/5m0s

running (4m13.0s), 50/50 VUs, 11971 complete and 0 interrupted iterations
default   [  84% ] 50 VUs  4m12.7s/5m0s

running (4m14.0s), 50/50 VUs, 12021 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  4m13.7s/5m0s

running (4m15.0s), 50/50 VUs, 12071 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  4m14.7s/5m0s

running (4m16.0s), 50/50 VUs, 12121 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  4m15.7s/5m0s

running (4m17.0s), 50/50 VUs, 12170 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  4m16.7s/5m0s

running (4m18.0s), 50/50 VUs, 12220 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  4m17.7s/5m0s

running (4m19.0s), 50/50 VUs, 12265 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  4m18.7s/5m0s

running (4m20.0s), 50/50 VUs, 12315 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  4m19.7s/5m0s

running (4m21.0s), 50/50 VUs, 12352 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  4m20.7s/5m0s

running (4m22.0s), 50/50 VUs, 12395 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  4m21.7s/5m0s

running (4m23.0s), 50/50 VUs, 12442 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  4m22.7s/5m0s

running (4m24.0s), 50/50 VUs, 12492 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  4m23.7s/5m0s

running (4m25.0s), 50/50 VUs, 12538 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  4m24.7s/5m0s

running (4m26.0s), 50/50 VUs, 12588 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  4m25.7s/5m0s

running (4m27.0s), 50/50 VUs, 12638 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  4m26.7s/5m0s

running (4m28.0s), 50/50 VUs, 12688 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  4m27.7s/5m0s

running (4m29.0s), 50/50 VUs, 12738 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  4m28.7s/5m0s

running (4m30.0s), 50/50 VUs, 12788 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  4m29.7s/5m0s

running (4m31.0s), 50/50 VUs, 12831 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  4m30.7s/5m0s

running (4m32.0s), 50/50 VUs, 12881 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  4m31.7s/5m0s

running (4m33.0s), 50/50 VUs, 12931 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  4m32.7s/5m0s

running (4m34.0s), 50/50 VUs, 12981 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  4m33.7s/5m0s

running (4m35.0s), 50/50 VUs, 13031 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  4m34.7s/5m0s

running (4m36.0s), 50/50 VUs, 13081 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  4m35.7s/5m0s

running (4m37.0s), 50/50 VUs, 13106 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  4m36.7s/5m0s

running (4m38.0s), 50/50 VUs, 13156 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  4m37.7s/5m0s

running (4m39.0s), 50/50 VUs, 13202 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  4m38.7s/5m0s

running (4m40.0s), 50/50 VUs, 13239 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  4m39.7s/5m0s

running (4m41.0s), 50/50 VUs, 13287 complete and 0 interrupted iterations
default   [  94% ] 50 VUs  4m40.7s/5m0s

running (4m42.0s), 50/50 VUs, 13322 complete and 0 interrupted iterations
default   [  94% ] 50 VUs  4m41.7s/5m0s

running (4m43.0s), 50/50 VUs, 13371 complete and 0 interrupted iterations
default   [  94% ] 50 VUs  4m42.7s/5m0s

running (4m44.0s), 50/50 VUs, 13418 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  4m43.7s/5m0s

running (4m45.0s), 50/50 VUs, 13468 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  4m44.7s/5m0s

running (4m46.0s), 50/50 VUs, 13518 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  4m45.7s/5m0s

running (4m47.0s), 50/50 VUs, 13565 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  4m46.7s/5m0s

running (4m48.0s), 50/50 VUs, 13615 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  4m47.7s/5m0s

running (4m49.0s), 50/50 VUs, 13663 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  4m48.7s/5m0s

running (4m50.0s), 50/50 VUs, 13712 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  4m49.7s/5m0s

running (4m51.0s), 50/50 VUs, 13761 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  4m50.7s/5m0s

running (4m52.0s), 50/50 VUs, 13811 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  4m51.7s/5m0s

running (4m53.0s), 50/50 VUs, 13861 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  4m52.7s/5m0s

running (4m54.0s), 50/50 VUs, 13911 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  4m53.7s/5m0s

running (4m55.0s), 50/50 VUs, 13961 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  4m54.7s/5m0s

running (4m56.0s), 50/50 VUs, 13997 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  4m55.7s/5m0s

running (4m57.0s), 50/50 VUs, 14025 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  4m56.7s/5m0s

running (4m58.0s), 50/50 VUs, 14060 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  4m57.7s/5m0s

running (4m59.0s), 50/50 VUs, 14104 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  4m58.7s/5m0s

running (5m00.0s), 50/50 VUs, 14151 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  4m59.7s/5m0s

running (5m01.0s), 32/50 VUs, 14201 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  5m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=57.43ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 42699  141.759059/s
    checks_succeeded...: 99.99% 42698 out of 42699
    checks_failed......: 0.00%  1 out of 42699

    ✓ ready
    ✓ users
    ✗ create
      ↳  99% — ✓ 14232 / ✗ 1

    HTTP
    http_req_duration..............: avg=18.37ms min=835µs med=5.78ms max=3.16s p(90)=23.68ms p(95)=57.43ms
      { expected_response:true }...: avg=18.37ms min=835µs med=5.78ms max=3.16s p(90)=23.68ms p(95)=57.42ms
    http_req_failed................: 0.00%  1 out of 42719
    http_reqs......................: 42719  141.825458/s

    EXECUTION
    iteration_duration.............: avg=1.05s   min=1s    med=1.02s  max=4.47s p(90)=1.09s   p(95)=1.19s  
    iterations.....................: 14233  47.25302/s
    vus............................: 32     min=32         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 31 MB  104 kB/s
    data_sent......................: 5.5 MB 18 kB/s



running (5m01.2s), 00/50 VUs, 14233 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  5m0s